---
kind: type
id: T:Autodesk.Revit.DB.BuildingPadType
source: html/355ade63-59db-5d4d-dac2-1f490ff7c1c0.htm
---
# Autodesk.Revit.DB.BuildingPadType

Represents a specific type of Building Pad.

## Syntax (C#)
```csharp
public class BuildingPadType : HostObjAttributes
```